In [31]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics.regression import mean_squared_error
#import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [20]:
data=pd.read_csv('data.csv')
test=pd.read_csv('test.csv')
data.head()

    x   y  sum
0   1   2    3
1  45  23   68
2  23  44   67
3  34  65   99
4  45  86  131

In [4]:
test.head()

   x  y  sum
0  5  6  NaN
1  6  6  NaN
2  7  6  NaN

In [5]:
data.describe()

              x           y        sum
count  10.00000   10.000000   10.00000
mean   42.20000   96.500000  138.70000
std    27.48252   63.580657   82.29088
min     1.00000    2.000000    3.00000
25%    25.75000   49.250000   75.75000
50%    39.50000   96.500000  146.00000
75%    60.00000  143.750000  177.75000
max    87.00000  191.000000  257.00000

In [6]:
data.isnull().sum()

x      0
y      0
sum    0
dtype: int64

In [8]:
test.isnull().sum()

x      0
y      0
sum    3
dtype: int64

In [9]:
test.dropna()

Empty DataFrame
Columns: [x, y, sum]
Index: []

In [10]:
test

   x  y  sum
0  5  6  NaN
1  6  6  NaN
2  7  6  NaN

In [22]:
X_train=data[['x','y']]
Y_train=data[['sum']]

In [32]:
X_test=test[['x','y']]
Y_test=test[['sum']]
Y_test

   sum
0   11
1   12
2   13
3  300

In [25]:
model1=LinearRegression()
model1.fit(X_train,Y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=1, normalize=False)

In [26]:
predictions=model1.predict(X_test)
print(predictions)

[[ 11.]
 [ 12.]
 [ 13.]
 [300.]]

In [27]:
mse1=mean_squared_error(Y_test,predictions)
print(mse1)

5.813904871478857e-28

In [28]:
Y_test

   sum
0   11
1   12
2   13
3  300

In [29]:
import numpy as np
rmse1=np.sqrt(mse1)
print(rmse1)

2.4112040294174312e-14